views/site/query13.php

SELECT * FROM `graphic_objects`
---

<?php $form = ActiveForm::begin();?>

<?=$form->field($model,'object_name')->dropDownList(ArrayHelper::map(GraphicObjects::find()->all(), 'id_type_job', 'job_name'))
    ->label('Выберите вид работы:')?>