views/site/query12.php


<?php $form = ActiveForm::begin();?>

<?=$form->field($model,'object_name')->dropDownList(ArrayHelper::map(Brigades::find()->all(), 'id_brigad', 'brigad_name'))
    ->label('Выберите бригаду:')?>
---
SELECT * FROM `brigades`