views/site/query9.php

<p style="font-size: 28px">9. Получить перечень объектов, возводимых в некотором строительном управлении или в целом по организации, на которых в обозначенный период времени выполнялся указанный вид строительных работ. </p>

<?php $form = ActiveForm::begin();
$z2 = Objects::find()
    ->select('id_object')
    ->all();
$z3 = Objects::find()
    ->select('id_uprav')
    ->all();
?>
<?=$form->field($model,'uprav_name')->dropDownList(ArrayHelper::map(StroiUprav::find()->where(['in','id_uprav',$z3])->all(), 'id_uprav', 'uprav_name'))
    ->label('Выберите строительное управление:'),
$form->field($model,'job_name')->dropDownList(ArrayHelper::map(GraphicObjects::find()->where(['in','id_object',$z2])->all(), 'id_type_job', 'job_name'))
    ->label('Выберите тип выполняемых работ:'),
---
SELECT `id_object` FROM `objects`
SELECT `id_uprav` FROM `objects`
SELECT * FROM `stroi_uprav` WHERE `id_uprav` IN (1, 1, 2, 3, 3)
SELECT * FROM `graphic_objects` WHERE `id_object` IN (4, 5, 3, 1, 2)