views/site/query8.php

<h1>8.	Получить отчет о сооружении указанного объекта</h1>

<?php $form = ActiveForm::begin();?>
<?=$form->field($model,'object_name')->dropDownList(ArrayHelper::map(Objects::find()->all(), 'id_object', 'object_name'))
    ->label('Выберите объект:'),
---
SELECT * FROM `objects`