views/site/query10.php



<div class="row">
    <div class="col-sm-6"> <?=$form->field($model,'object_name')->dropDownList(ArrayHelper::map(Objects::find()->all(), 'id_object', 'object_name'))
            ->label('Выберите объект:')?></div>
    <div class="col-sm-6"> <?=$form->field($model,'uprav_name')->dropDownList(ArrayHelper::map(StroiUprav::find()->all(), 'id_uprav', 'uprav_name'))
            ->label('Выберите управление:')?></div>
---
SELECT * FROM `objects`
SELECT * FROM `stroi_uprav`